Revit 2027 API
BuiltInFailures.DividedPathFailures.DividedPathIntersectionPolycurveParamsStepFailed Property
 Intersection failed.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId DividedPathIntersectionPolycurveParamsStepFailed { get; }
Public Shared ReadOnly Property DividedPathIntersectionPolycurveParamsStepFailed As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ DividedPathIntersectionPolycurveParamsStepFailed {
	FailureDefinitionId^ get ();
}
static member DividedPathIntersectionPolycurveParamsStepFailed : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.DividedPathFailures Class
Autodesk.Revit.DB Namespace